The current test for updating the subnets passes, but I'm struggling to set up the test case for adding a subnet.
The problem is that the subnets are only known after apply, so the apply with an added subnet actually sees a deletion:
```
# aws_lb.test must be replaced
-/+ resource "aws_lb" "test" {
      ~ arn                              = "arn:aws:elasticloadbalancing:eu-west-1:795746500882:loadbalancer/net/test/4b555e1c6ace9dce" -> (known after apply)
      ~ arn_suffix                       = "net/test/4b555e1c6ace9dce" -> (known after apply)
      ~ dns_name                         = "test-4b555e1c6ace9dce.elb.eu-west-1.amazonaws.com" -> (known after apply)
      ~ id                               = "arn:aws:elasticloadbalancing:eu-west-1:795746500882:loadbalancer/net/test/4b555e1c6ace9dce" -> (known after apply)
      ~ ip_address_type                  = "ipv4" -> (known after apply)
        name                             = "test"
      ~ security_groups                  = [] -> (known after apply)
      ~ subnets                          = [ # forces replacement
          - "subnet-03db0ed6e37668460",
          - "subnet-060e6ef824d6d1224",
        ] -> (known after apply) # forces replacement
```

Can you help me to circumvent this issue? Should I construct a case with static subnets? But this implies that the adding of subnets is not detected for dynamically referenced subnets. For our use case, we actually need a dynamic mapping of subnets.

More concretely, is there a way to check if a subnet was added with the support for dynamic resource reference?
